/*-----------------------------------------------------------
**
** 版权: 中国航空无线电电子研究所, 2020年
**
** 文件名: TouchRoam.h
**
** 描述: 本文件包含通过触摸操作进行的移动、旋转、缩放、俯仰等函数的头文件。
**
** 定义的函数:  
**
**                            
** 设计注记: 
**
** 作者：
**		LPF。
** 
**
** 更改历史:
**		2020年4月8日11:03:52 LPF 创建此文件
**-----------------------------------------------------------
*/
/*-----------------------------------------------------------
** 头文件引用
**-----------------------------------------------------------
*/
#ifndef __TOUCHROAM_H__
#define __TOUCHROAM_H__


#if !defined(OPENGL_ES_2) && !defined(OPENGL_ES_3)
/*.BH--------------------------------------------------------
**
** 函数名: BOOL touchRoamXY()
**
** 描述:  移动操作
**
** 输入参数:  
**	state ：0 不开启移动，1：开启移动
**  x, y：漫游的屏幕坐标，屏幕左上角为原点
**
** 输出参数：无
**
** 返回值：TRUE 成功or FALSE 失败
**          
**
** 设计注记:  外部接口1
**
**.EH--------------------------------------------------------
*/
void touchRoamXY(int state, float x, float y );

/*.BH--------------------------------------------------------
**
** 函数名: BOOL touchScale()
**
** 描述:  缩放操作
**
** 输入参数:  
**	state ：0：不开启缩放，1：开启缩放
**  scale：0：缩小，1：放大
**
** 输出参数：无
**
** 返回值：TRUE 成功or FALSE 失败
**          
**
** 设计注记:  外部接口2
**
**.EH--------------------------------------------------------
*/
void touchScale(int state, float scale);

/*.BH--------------------------------------------------------
**
** 函数名: BOOL touchYaw()
**
** 描述:  偏航角旋转操作
**
** 输入参数:  
**	state ：0：不开启偏航角旋转，1：开启偏航角旋转
**  yaw：0-360，顺时针为正
**
** 输出参数：无
**
** 返回值：TRUE 成功or FALSE 失败
**          
**
** 设计注记:  外部接口3
**
**.EH--------------------------------------------------------
*/
void touchYaw(int state, float yaw);

/*.BH--------------------------------------------------------
**
** 函数名: BOOL touchPitch()
**
** 描述:  俯仰角旋转操作
**
** 输入参数:  
**	state ：0：不开启俯仰角旋转，1：开启俯仰角旋转
**  pitch：(0,-90)，向上为正
**
** 输出参数：无
**
** 返回值：TRUE 成功or FALSE 失败
**          
**
** 设计注记:  外部接口4
**
**.EH--------------------------------------------------------
*/
void touchPitch(int state, float pitch);

/*.BH--------------------------------------------------------
**
** 函数名: BOOL touchRotPointXY()
**
** 描述:  设置yaw、pitch的旋转中心的屏幕坐标
**
** 输入参数: 
**		height:	屏幕的长度	 
**		x: 目前不起作用，默认是屏幕中心线 
**		y：旋转中心的屏幕坐标，屏幕左上角为原点
**
** 输出参数：无
**
** 返回值：TRUE 成功or FALSE 失败
**          
**
** 设计注记:  外部接口5
**
**.EH--------------------------------------------------------
*/
void touchRotPointXY(float width ,float height, float x, float y);


/*.BH--------------------------------------------------------
**
** 函数名: BOOL touchMiddleDeltaSet()
**
** 描述:  设置缩放的尺度,单位米
**
** 输入参数: 
**		value: 缩放的尺度，单位米
**
** 输出参数：无
**
** 返回值：TRUE 成功or FALSE 失败
**          
**
** 设计注记:  外部接口6
**
**.EH--------------------------------------------------------
*/
void touchMiddleDeltaSet(float value);


#endif
#endif
