/*-----------------------------------------------------------
**
** 版权: 中国航空无线电电子研究所, 2015年
**
** 文件名: LayerCombineApi.h
**
** 描述: 本文件包含图层控制的api文件。
**
** 定义的函数:  
**
**                            
** 设计注记: 
**
** 作者：
**		LPF。
** 
**
** 更改历史:
**		2017-9-21 10:42 LPF 创建此文件
**-----------------------------------------------------------
*/
/*-----------------------------------------------------------
** 头文件引用
**-----------------------------------------------------------
*/
#ifndef _LAYERCOMBINEAPI_H_
#define _LAYERCOMBINEAPI_H_

#include "../define/mbaseType.h"
#include "mapRender.h"


/*-----------------------------------------------------------
** 结构体声明
**-----------------------------------------------------------
*/


/*-----------------------------------------------------------
** 函数声明
**-----------------------------------------------------------
*/

//根据输入的图层叠加模式,判断当前帧使用的底图纹理是否与上一帧使用的不一致,如果不同则进行绑定纹理及切换纹理的操作
f_uint32_t bindAndSubRenderTexID(sQTMAPNODE * pNode, int tex_order);

//根据场景绘制句柄中的底图显示模式设置内部的图层叠加模式
void setLayDisplay(sGLRENDERSCENE  * pHandle);


/*-----------------------------------------------------------
** 外部变量声明
**-----------------------------------------------------------
*/



#endif
