/*-----------------------------------------------------------
**
** 版权: 中国航空无线电电子研究所, 2015年
**
** 文件名: vecMapCollision.h
**
** 描述: 
**
** 作者：
**     邓秀剑(DXJ)，2015年8月开始编写本文件。
** 
**
** 更改历史:
**     2015年8月09日 创建本文件。
**     xxxx年x月xx日 初始版本发布 
**      
** 
**
**-----------------------------------------------------------
*/
#ifndef __TEXT_COLLISION_H__
#define __TEXT_COLLISION_H__

/*-----------------------------------------------------------
** 头文件引用
**-----------------------------------------------------------
*/


/*-----------------------------------------------------------
** 文字量和宏声明
**-----------------------------------------------------------
*/
#define MAX_NO_COLLISION_POINT_ELEMENT_NUMBER  5000
#define COLLISION_EXTERNSION_3D 1.0F
#define TEXT_ALIGN_LEFT   1
#define TEXT_ALIGN_TOP    2
#define TEXT_ALIGN_BOTTOM 3
#define TEXT_ALIGN_MIDDLE 4
#define _DEBUG_PRINT_ERROR_ printf("error! %s,%d,%s\n", __FILE__, __LINE__, __FUNCTION__);

/*-----------------------------------------------------------
** 类型定义
**-----------------------------------------------------------
*/


/*-----------------------------------------------------------
** 函数声明
**-----------------------------------------------------------
*/

/*.BH--------------------------------------------------------
**
** 函数名: 
**
** 描述: 
**
** 输入参数:  视口宽度和高度。
**
** 输出参数： 无。
**
** 返回值： 无。
**
** 设计注记:  
**
**.EH--------------------------------------------------------
*/
/*每画一帧画面之前都要调这个函数，才能正确实现碰撞检测*/
void collisionInfoInit3d(int view_width, int view_height);

/*0：不碰撞；
1：碰撞*/
int isPointCollision3d(float sx, float sy, int symbolSize, float textwidth, int fontheight, int alignType);

#endif  /* #ifndef __VEC_MAP_COLLISION_H__ */