/*-----------------------------------------------------------
**
** 版权: 中国航空无线电电子研究所, 2015年
**
** 文件名: PathStore.h
**
** 描述: 本文件包含飞机航迹记录及航迹读取功能的函数。
**
** 定义的函数:  
**
**                            
** 设计注记: 
**
** 作者：
**		LPF。
** 
**
** 更改历史:
**		2016-12-26 9:19 LPF 创建此文件
**-----------------------------------------------------------
*/
/*-----------------------------------------------------------
** 头文件引用
**-----------------------------------------------------------
*/
#ifndef _PathStore_H_
#define _PathStore_H_



#include "../mapApi/common.h"
#include "../define/mbaseType.h"
#include "../define/macrodefine.h"
#include "../engine/libList.h"

/*-----------------------------------------------------------
** 结构体声明
**-----------------------------------------------------------
*/
typedef struct tagModelState
{
	f_int32_t	m_flag;					//记录数据的文件头标记，默认是12341234
	PT_3D		m_modelPos;				//模型轨迹 lat, lon, hei
	PT_3D		m_modelAngle;   		//模型轨迹 yaw, pitch, roll

	//链表节点
	stList_Head stListHead;
} ModelState, *LPModelState;

/*-----------------------------------------------------------
** 函数声明
**-----------------------------------------------------------
*/
// 1.航线记录功能,在sphereRender.c中使用
BOOL AirLineRecord();

// 2.读取航线记录文件,在程序初始化中使用
BOOL AirLineRead();

// 3.根据航线记录数据，赋值给模型位置、姿态，在外部setParam中使用
BOOL SetModelAirline(f_int32_t * model_id, f_int32_t model_Num);

// 4. 输出航线点的数据
BOOL OutAirline(f_int32_t airline_id, LPModelState airline_out);

// 5.测试从文件中读取航线数据，赋值给视点
void TestAirLineSet();

/*-----------------------------------------------------------
** 外部变量声明
**-----------------------------------------------------------
*/



#endif
